import math # Добавляем билиотеку

# Вводим 3 числа
a = float(input("Введите a: "))
b = float(input("Введите b: "))
c = float(input("Введите c: "))

# Определяем квадратное уравнение или нет
if a == 0:
    print("Это не квадратное уравнение")
else:
    D = b**2 - 4*a*c # Вычисляем дискриминант
    
    # Ищем значения х при D > 0
    if D > 0:
         x1 = (-b + math.sqrt(D)) / (2*a)
         x2 = (-b - math.sqrt(D)) / (2*a)
    
    # Ищем х при D == 0
    elif D == 0:
        x = -b / (2*a)
        print(f"Один корень: x = {x:.2f}")
    
    # При остальных значениях х выводим сообщение
    else:
        print("Нет действительных корней")