# Вводим стороны треугольника
a = float(input("Введите сторону a: "))
b = float(input("Введите сторону b: "))
c = float(input("Введите сторону c: "))

# Определем условие существования треугольника
if a + b > c and a + c > b and b + c > a:
    # Условие равностороннего треугольника
    if a == b == c:
        print("Равносторонний треугольник")
    # Условие равнобедренного треугольника
    elif a == b or a == c or b == c:
        print("Равнобедренный треугольник")
    else:
        print("Разносторонний треугольник")

# Если стороны не подходят под условие
else:
    print("Треугольник не существует")
